Rhino.Geometry.InstanceDefinitionGeometry.Url
Gets or sets the URL or hyperlink of the definition.

Rhino.Geometry.InstanceDefinitionGeometry.UrlDescription
Gets or sets the description of the URL or hyperlink of the definition.