Rhino.FileIO.File3dmInstanceDefinitionTable.Add(System.String,System.String,System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
url: A URL or hyperlink.
urlTag: A description of the URL or hyperlink.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.